Revit 2027 API
BuiltInFailures.GeneralFailures.ConvertingOldAxisToNormal Property
 This operation will convert the existing axis of revolution to a normal line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ConvertingOldAxisToNormal { get; }
Public Shared ReadOnly Property ConvertingOldAxisToNormal As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ConvertingOldAxisToNormal {
	FailureDefinitionId^ get ();
}
static member ConvertingOldAxisToNormal : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace